; domain
(define (domain pacman-72)
  (:requirements :strips :typing)
  (:types position)

  (:predicates
    (at ?pos - position)
    (not_at ?pos - position)          ; complement of at
    (visited ?pos - position)
    (connected ?from ?to - position)
    (hasFood ?pos - position)
    (noFood ?pos - position)          ; complement of hasFood
    (carryingFood) 
  )

  (:action move
    :parameters (?from ?to - position)
    :precondition (and
      (at ?from)
      (not_at ?to)
      (connected ?from ?to)
    )
    :effect (and
      (at ?to)
      (not (at ?from))        ; DELETE: Pacman is no longer at ?from
      (not_at ?from)
      (visited ?to)
      (not (not_at ?to))      ; DELETE: ?to is no longer marked as not_at
    )
  )

  (:action eat
    :parameters (?pos - position)
    :precondition (and
      (at ?pos)
      (hasFood ?pos)
    )
    :effect (and
      (carryingFood)
      (noFood ?pos)
      (not (hasFood ?pos))   ; DELETE: the food is gone
    )
  )
)

; problem
(define (problem pacman-72)
    (:domain pacman-72)
    (:objects
        p00 p01 p02 p03 p10 p11 p12 p13 p20 p21 p22 p23 p30 p31 p32 p33 - position
    )

    (:init
        (not_at p00)
        (not (at p00))
        (not_at p01)
        (not (at p01))
        (not_at p02)
        (not (at p02))
        (not_at p03)
        (not (at p03))
        (at p10)
        (not (not_at p10))
        (not_at p11)
        (not (at p11))
        (not_at p12)
        (not (at p12))
        (not_at p13)
        (not (at p13))
        (not_at p20)
        (not (at p20))
        (not_at p21)
        (not (at p21))
        (not_at p22)
        (not (at p22))
        (not_at p23)
        (not (at p23))
        (not_at p30)
        (not (at p30))
        (not_at p31)
        (not (at p31))
        (not_at p32)
        (not (at p32))
        (not_at p33)
        (not (at p33))
        (noFood p00)
        (not (hasFood p00))
        (noFood p01)
        (not (hasFood p01))
        (noFood p02)
        (not (hasFood p02))
        (noFood p03)
        (not (hasFood p03))
        (noFood p10)
        (not (hasFood p10))
        (noFood p11)
        (not (hasFood p11))
        (noFood p12)
        (not (hasFood p12))
        (hasFood p13)
        (not (noFood p13))
        (noFood p20)
        (not (hasFood p20))
        (noFood p21)
        (not (hasFood p21))
        (hasFood p22)
        (not (noFood p22))
        (noFood p23)
        (not (hasFood p23))
        (hasFood p30)
        (not (noFood p30))
        (noFood p31)
        (not (hasFood p31))
        (noFood p32)
        (not (hasFood p32))
        (noFood p33)
        (not (hasFood p33))
        (connected p00 p10)
        (connected p10 p00)
        (connected p00 p01)
        (connected p01 p00)
        (connected p01 p11)
        (connected p11 p01)
        (connected p01 p02)
        (connected p02 p01)
        (connected p02 p12)
        (connected p12 p02)
        (connected p02 p03)
        (connected p03 p02)
        (connected p03 p13)
        (connected p13 p03)
        (connected p10 p20)
        (connected p20 p10)
        (connected p10 p11)
        (connected p11 p10)
        (connected p11 p21)
        (connected p21 p11)
        (connected p11 p12)
        (connected p12 p11)
        (connected p12 p22)
        (connected p22 p12)
        (connected p12 p13)
        (connected p13 p12)
        (connected p13 p23)
        (connected p23 p13)
        (connected p20 p30)
        (connected p30 p20)
        (connected p20 p21)
        (connected p21 p20)
        (connected p21 p31)
        (connected p31 p21)
        (connected p21 p22)
        (connected p22 p21)
        (connected p22 p32)
        (connected p32 p22)
        (connected p22 p23)
        (connected p23 p22)
        (connected p23 p33)
        (connected p33 p23)
        (connected p30 p31)
        (connected p31 p30)
        (connected p31 p32)
        (connected p32 p31)
        (connected p32 p33)
        (connected p33 p32)
    )

    (:goal (and
        (noFood p22)
        (noFood p30)
        (noFood p13)
    ))
)

; plan
1. (move p10 p20)
   deleted: (at p10) (not_at p20)
   added: (at p20) (not_at p10) (visited p20)
   goals met: 0 of 3
2. (move p20 p30)
   deleted: (at p20) (not_at p30)
   added: (at p30) (not_at p20) (visited p30)
   goals met: 0 of 3
3. (eat p30)
   deleted: (hasfood p30)
   added: (carryingfood) (nofood p30)
   goals met: 1 of 3
4. (move p30 p31)
   deleted: (at p30) (not_at p31)
   added: (at p31) (not_at p30) (visited p31)
   goals met: 1 of 3
5. (move p31 p21)
   deleted: (at p31) (not_at p21)
   added: (at p21) (not_at p31) (visited p21)
   goals met: 1 of 3
6. (move p21 p22)
   deleted: (at p21) (not_at p22)
   added: (at p22) (not_at p21) (visited p22)
   goals met: 1 of 3
7. (eat p22)
   deleted: (hasfood p22)
   added: (nofood p22)
   goals met: 2 of 3
8. (move p22 p23)
   deleted: (at p22) (not_at p23)
   added: (at p23) (not_at p22) (visited p23)
   goals met: 2 of 3
9. (move p23 p13)
   deleted: (at p23) (not_at p13)
   added: (at p13) (not_at p23) (visited p13)
   goals met: 2 of 3
10. (eat p13)
   deleted: (hasfood p13)
   added: (nofood p13)
   goals met: 3 of 3
